{"file":".\\\Statistics and classification of smart contract bugs\\Data\\Calculation\\Integer division\\bug contract\\integerDivision.sol", "location": 36},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Calculation\\integer overflow and underflow\\bug contract\\Overflow.sol", "location": 14},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Calculation\\integer overflow and underflow\\bug contract\\underFlow.sol", "location": 16},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Calculation\\Integer signedness\\bug contract\\IntegerSignednessError.sol", "location": 26},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Calculation\\Integer truncation\\bug contract\\truncationError.sol", "location": 21},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Calculation\\Wrong operator\\bug contract\\wrongOpe.sol", "location": 26},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Hidden\\Hidden built-in symbols\\bug contracts\\hiddenSymbol.sol", "location": 13},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Hidden\\Hide state variables\\bug contract\\shadowingState.sol", "location": 18},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Hidden\\Incorrect inheritance order\\bug contract\\FalseOrder.sol", "location": 29},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Initialization\\Uninitialized local variables\\bug contract\\uninitLocalVar.sol", "location": 16},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Initialization\\Uninitialized state variables\\bug contract\\uninitStateVar.sol", "location": [7, 8]},
{"file":".\\Statistics and classification of smart contract bugs\\Data\\Initialization\\Uninitialized storage variable\\bug contract\\UninitStorage.sol", "location": 46},
{"file":".\\Statistics and classification of smart contract bugs\\Description\\Output\\Right-To-Left-Overridecontrolcharacter (U+202E)\\bug contract\\GuessNumber.sol", "location": 32},
{"file":".\\Statistics and classification of smart contract bugs\\Environment\\Supporting software\\continue in do-while\\bug contract\\dowhileContinue.sol", "location": 27},
{"file":".\\Statistics and classification of smart contract bugs\\Environment\\Supporting software\\Removes dynamic array elements\\bug contract\\deleteDynamic.sol", "location": 34},
{"file":".\\Statistics and classification of smart contract bugs\\Interaction\\Contract call\\Re-entrancy vulnerability\\bug contract\\re-entrancy.sol", "location": 25},
{"file":".\\Statistics and classification of smart contract bugs\\Interaction\\Contract call\\Re-entrancy vulnerability\\bug contract\\simpleDAO.sol", "location": 21},
{"file":".\\Statistics and classification of smart contract bugs\\Interaction\\Contract call\\Re-entrancy vulnerability\\bug contract\\SplitReentrant.sol", "location": 21},
{"file":".\\Statistics and classification of smart contract bugs\\Interaction\\Contract call\\Unhandled exceptions\\bug contract\\unhandledException.sol", "location": 32},
{"file":".\\Statistics and classification of smart contract bugs\\Interaction\\Ether flow\\Forced accept ethers\\bug contract\\BobAnswer.sol", "location": 23},
{"file":".\\Statistics and classification of smart contract bugs\\Interaction\\Ether flow\\Locked money\\bug contract\\lockedMoney.sol", "location": 7},
{"file":".\\Statistics and classification of smart contract bugs\\Interaction\\Ether flow\\Pre-sent ether\\bug contract\\PreSentEther.sol", "location": 20},
{"file":".\\Statistics and classification of smart contract bugs\\Interface\\Parameter\\Hash Collisions With Multiple Variable Length Arguments\\bug contracat\\HashCollision.sol", "location": 62},
{"file":".\\Statistics and classification of smart contract bugs\\Interface\\Parameter\\Short address attack\\bug contract\\shortAddressAttack.sol", "location": 76},
{"file":".\\Statistics and classification of smart contract bugs\\Interface\\Parameter\\Signature with wrong parameter\\bug contract\\SigWrongPara.sol", "location": 18},
{"file":".\\Statistics and classification of smart contract bugs\\Interface\\Parameter\\The call address or data are externally controlled\\bug contract\\badDelegate.sol", "location": 20},
{"file":".\\Statistics and classification of smart contract bugs\\Interface\\Parameter\\The call address or data are externally controlled\\bug contract\\badProxy.sol", "location": 21},
{"file":".\\Statistics and classification of smart contract bugs\\Interface\\Token Interface\\Nonstandard token interface\\bug contract\\unstandardERC20.sol", "location": [12, 21, 32, 45, 62, 78, 92]},
{"file":".\\Statistics and classification of smart contract bugs\\Interface\\Token Interface\\Nonstandard token interface\\bug contract\\unstandardERC721.sol", "location": [167, 184, 193, 326, 372]},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Assembly code\\Any type of specified function variable\\bug contract\\ArbitraryFunctionType.sol", "location": 28},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Assembly code\\Use assembly code return in the constructor\\bug contract\\returnInCons.sol", "location": 12},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\Complex fallback function\\bug contract\\complexFallback.sol", "location": 37},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\DOS by gaslimit\\Costly loop\\bug contract\\infiniteLoop.sol", "location": 33},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\DOS by gaslimit\\Costly loop\\bug contract\\NestedCall.sol", "location": 27},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\DOS by gaslimit\\Costly loop\\bug contract\\varIsNotSafe.sol", "location": 25},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\DOS by gaslimit\\Delete dynamic array\\bug contract\\deleteDynamicArray.sol", "location": [33, 34]},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\DOS by non-existent address or contract\\bug contract\\HardCodeAddress.sol", "location": 12},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\DOS by non-existent address or contract\\bug contract\\Overwhelming.sol", "location": 12},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Denial of service\\DOS by non-existent address or contract\\bug contract\\PushButNoPull.sol", "location": 19},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Fairness\\Results of contract execution affected by miners\\bug contract\\DangerousRandomNumbers.sol", "location": 11},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Fairness\\Results of contract execution affected by miners\\bug contract\\timeDependence.sol", "location": 38},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Fairness\\Results of contract execution affected by miners\\bug contract\\timeDependence1.sol", "location": 18},
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Fairness\\Transaction order dependence\\contract with bug\\approve.sol", "location": 109}
{"file":".\\Statistics and classification of smart contract bugs\\Logic\\Storage\\Storage overlap attack\\bug contract\\ArbitraryWrite.sol", "location": 21},
{"file":".\\Statistics and classification of smart contract bugs\\Performance\\Gas\\byte[]\\bug contract\\byte[].sol", "location": 7},
{"file":".\\Statistics and classification of smart contract bugs\\Performance\\Gas\\Invariant in loop\\bug contract\\ConstBalanceInLoop.sol", "location": 20},
{"file":".\\Statistics and classification of smart contract bugs\\Performance\\Gas\\Invariant is not declared constant\\bug contract\\ImmutableConstant.sol", "location": [8, 9]},
{"file":".\\Statistics and classification of smart contract bugs\\Performance\\Gas\\Unused public functions within a contract should be declared external\\bug contract\\publicToExternal.sol", "location": [17, 23]},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Authority control\\Replay attack\\bug contract\\replayAttack1.sol", "location": 24},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Authority control\\Replay attack\\bug contract\\replatAttack2.sol", "location": 28},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Authority control\\Suicidal contract\\bug contract\\SuicideEasily.sol", "location": 24},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Authority control\\Txorigin for authentication\\bug contract\\badTxorigin.sol", "location": 20},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Authority control\\Wasteful contract\\bug contract\\prodigal.sol", "location": 20},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Authority control\\Write the wrong constructor name\\bug contract\\MissConstructor.sol", "location": 13},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Authority control\\Write the wrong constructor name\\bug contract\\MissConstructor1.sol", "location": 14},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Privacy\\Non-public variables are accessed by public or external function\\bug contract\\privatePass.sol", "location": 16},
{"file":".\\Statistics and classification of smart contract bugs\\Security\\Privacy\\Public data\\bug contract\\privateModifier.sol", "location": [10, 20]},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Maintainability\\Implicit visibility level\\bug contract\\ImplicitVisibility.sol", "location": 33},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Maintainability\\Implicit visibility level\\bug contract\\ImplicitVisibility1.sol", "location": [9, 10, 11, 13, 14, 15, 17, 18]},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Maintainability\\Non-standard naming\\bug contract\\wrongName.sol", "location": [6, 8, 11]},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Maintainability\\too many digits\\bug contract\\tooManyDigits.sol", "location": 7},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Maintainability\\Unlimited compiler versions\\bug contract\\UncappedVersion.sol", "location": 2},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Maintainability\\Unlimited compiler versions\\bug contract\\UncappedVersion1.sol", "location": 2},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Maintainability\\Use deprecated built-in symbols\\bug contract\\deprecated.sol", "location": [15, 18, 20, 22, 26, 32, 37]},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Programming specification\\Change the contract status in the view or constant function\\bug contract\\untrusted View and Constant.sol", "location": [19, 24]},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Programming specification\\Improper use of require, assert, and revert\\bug contract\\AssertError.sol", "location": 15},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Programming specification\\Improper use of require, assert, and revert\\bug contract\\BarRequireError.sol", "location": [12, 20]},
{"file":".\\Statistics and classification of smart contract bugs\\Standard\\Programming specification\\Improper use of require, assert, and revert\\bug contract\\RevertError.sol", "location": 25}